src/main/resources/translate.wsdl

<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
                  xmlns:tns="http://example.com/demo"
                  targetNamespace="http://example.com/demo">
    <wsdl:types>
        <xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema"
                   targetNamespace="http://example.com/demo"
                   xmlns:tns="http://example.com/demo"
                   elementFormDefault="qualified">
            <xs:element name="TranslateRequest" type="xs:string"/>
            <xs:element name="TranslateResponse" type="xs:string"/>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="TranslateRequest">
        <wsdl:part name="request" element="tns:TranslateRequest"/>
    </wsdl:message>
    <wsdl:message name="TranslateResponse">
        <wsdl:part name="response" element="tns:TranslateResponse"/>
    </wsdl:message>
    <wsdl:portType name="TranslatePortType">
        <wsdl:operation name="translate">
            <wsdl:input message="tns:TranslateRequest"/>
            <wsdl:output message="tns:TranslateResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="TranslateBinding" type="tns:TranslatePortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="translate">
            <soap:operation soapAction=""/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="TranslateService">
        <wsdl:port name="TranslatePort" binding="tns:TranslateBinding">
            <soap:address location="http://localhost:8080/wsec1e1/"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
